Revit 2027 API
FamilyInstance.GetSpatialElementCalculationPoint Method
Gets the location of the calculation point for this instance.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ GetSpatialElementCalculationPoint()
Public Function GetSpatialElementCalculationPoint As XYZ
public:
XYZ^ GetSpatialElementCalculationPoint()
member GetSpatialElementCalculationPoint : unit -> XYZ
Return Value
XYZ
A 3d point.
Exceptions
Exception | Condition
InvalidOperationException | Thrown if this instance does not have a single calculation point.
Remarks
See HasSpatialElementCalculationPoint for reference.
See Also
Reference
FamilyInstance Class
Autodesk.Revit.DB Namespace